app/controllers/friendships_controller.rb

  def create
    #@friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    @newfriendship = current_user.newfriendships.build(:friend_id => params[:friend_id])
    if  @newfriendship.save
---
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["friend_id", 50], ["user_id", 1], ["created_at", "2017-12-11 10:45:46.527216"], ["updated_at", "2017-12-11 10:45:46.527216"]]
INSERT INTO "newfriendships" ("new_friend_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["new_friend_id", 50], ["user_id", 1], ["created_at", "2017-12-16 08:34:09.083672"], ["updated_at", "2017-12-16 08:34:09.083672"]]

  def destroy
    @friendship = current_user.friendships.find_by(friend_id: params[:id])
    @friendship.destroy

    user=User.find_by_id(params[:id])
    current_user.chats.each do |chat|
      if (chat.users-[user, current_user]).blank?
        chat.destroy
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? LIMIT 1  [["user_id", 50], ["friend_id", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 50]]
SELECT "chats".* FROM "chats" INNER JOIN "chats_users" ON "chats"."id" = "chats_users"."chat_id" WHERE "chats_users"."user_id" = ?  [["user_id", 49]]
SELECT "users".* FROM "users" INNER JOIN "chats_users" ON "users"."id" = "chats_users"."user_id" WHERE "chats_users"."chat_id" = ?  [["chat_id", 2]]
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 2]]