app/controllers/newfriendships_controller.rb

  def create        #处理 post请求
      newfriend = current_user.newfriendships.find_by(user_id: params[:friend_id])        #为什么一直是空的对象呢？？
      flash[:success]= params[:friend_id]
      friendship = Friendship.new
      friendship.friend_id = newfriend.new_friend_id
      friendship.user_id = newfriend.user_id
      if friendship.save!
        self.destroy(newfriend.new_friend_id);
---
SELECT  "newfriendships".* FROM "newfriendships" WHERE "newfriendships"."user_id" = ? AND "newfriendships"."user_id" = ? LIMIT 1  [["user_id", 50], ["user_id", 50]]
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["friend_id", 50], ["user_id", 1], ["created_at", "2017-12-16 12:27:18.408883"], ["updated_at", "2017-12-16 12:27:18.408883"]]
DELETE FROM "newfriendships" WHERE "newfriendships"."id" = ?  [["id", 1]]