app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "role", "password_digest", "sex", "phonenumber", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_sign
    newuser = User.new
    newuser.name = params[:session][:name]
    newuser.email = params[:session][:email].downcase
    # newuser.role = params[:session][:role]
    newuser.password_digest = User.digest(params[:session][:password])
    # newuser.sex = params[:session][:sex]
    # newuser.phonenumber = params[:session][:phonenumber]
    # newuser.status = params[:session][:status]
    if newuser.save!    #加上!会知道哪里不能保存通过